
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//F
	Кат = "F:\Задания";
	//мСтрокФайла = Новый Массив();
	//Файл = Новый ЧтениеТекста(Кат +  "/1.txt", КодировкаТекста.UTF8);
	//
	//Строка = Файл.ПрочитатьСтроку();
	////Если Строка <> Неопределено Тогда
	////	мСтрокФайла.Добавить(Строка);
	////КонецЕсли;
	//
	//ТекущаяГлава = Неопределено;
	//ТекущееЗанятие = Неопределено;
	//ТекущееЗадание = Неопределено;
	//
	//Пока Строка <> Неопределено Цикл
	//	
	//	
	//	Если стрНайти(Строка, "Глава") > 0 Тогда
	//		ТекущаяГлава = Кат + "/" + Строка;
	//		СоздатьКаталог(ТекущаяГлава);
	//	КонецЕсли;
	//	
	//	Если стрНайти(Строка, "Занятие") > 0 Тогда
	//		ТекущееЗанятие = ТекущаяГлава + "/" + Строка;
	//		СоздатьКаталог(ТекущееЗанятие);
	//	КонецЕсли;
	//	
	//	Если стрНайти(Строка, "Практическое") > 0 Тогда
	//		ТекущееЗадание = ТекущееЗанятие + "/" + Строка;
	//		СоздатьКаталог(ТекущееЗадание);
	//	КонецЕсли;
	//	Строка = Файл.ПрочитатьСтроку();
	//КонецЦикла;
	//
	//Файл.Закрыть(); 
	Ф = НайтиФайлы(Кат + "/2", "*", истина);
	//ПереместитьФайл("C:\est.txt", "C:\estnew.txt"); 
	Для Каждого Фа Из Ф Цикл
		//Для Сч = 1 По 5 Цикл
			Поиск = "1Cv8-Optimize-v2-";
			а = СтрЗаменить(Фа.Имя, "PW-", "") ;
			а = СтрЗаменить(а, "PW-Solution-", "") ;
			
			
			а = СтрЗаменить(а, ".pdf", "") ;
			
			а = СтрЗаменить(а, "Solution-", "") ;
			а = СтрЗаменить(а, "-materials.rar", "") ;
			б = Число(а);
			
			м = НайтиФайлы(Кат, "Практическое задание №" + б, Истина);
			Если  М.Количество() Тогда
				КопироватьФайл(Фа.ПолноеИмя, М[0].ПолноеИмя + "/" + Фа.Имя);
				Сообщить(Фа.ПолноеИмя + Символы.ПС + М[0].ПолноеИмя + "/" + Фа.Имя);
			КонецЕсли;
			
			
			//Если СтрНайти(Фа.ПолноеИмя, Поиск) > 0 Тогда
			//	ПереместитьФайл(Фа.ПолноеИмя, СтрЗаменить(Фа.ПолноеИмя, Поиск, ""));
			//КонецЕсли;
		//КонецЦикла;	
	КонецЦикла;
КонецПроцедуры
